import java.util.Scanner;

public class LabFirst3 {
    public static void main(String[] args) {
// Є 2 матриці однакової розмірності, треба збудувати вектор,
//  який працює за правилом - i-ий  рядок A збігається з i-им стовпцем B -> 1, не збігається -> 0

Scanner in = new Scanner(System.in);
in.close();
    
}
}

   

//Задано текст, слова в якому розділені пробілами і розділовими знаками. Розробити програму,
// яка вилучає в кожному слові цього тексту всі попередні входження останньої літери.
// До прикладу є i w! an_t t.0 

